nacaAirfoil_sonicFoam_LaunderSharmaKE/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $temperature;

boundaryField
{
    "(inlet|outlet).*"
    {
        type            inletOutlet;
        inletValue      uniform $temperature;
        value           $internalField;
    }

    "sym.*"
    {
        type            empty;
    }

    "wall.*"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
