nacaAirfoil_sonicFoam_LaunderSharmaKE/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

# Convert mesh from resources directory
runApplication star4ToFoam -scale 1 \
    "$FOAM_TUTORIALS"/resources/geometry/nacaAirfoil/nacaAirfoil

# Symmetry plane -> empty
sed -i -e 's/symmetry\([)]*;\)/empty\1/' constant/polyMesh/boundary

# Don't need these extra files (from star4ToFoam conversion)
rm -f \
   constant/cellTable \
   constant/polyMesh/cellTableId \
   constant/polyMesh/interfaces  \
   constant/polyMesh/origCellId  \
   ;

if isParallel "$@"
then

    runApplication decomposePar

    runParallel $(getApplication)

else

    runApplication $(getApplication)

fi

#------------------------------------------------------------------------------
